app/controllers/messages_controller.rb

  def index
    @messages = Message.all
---
SELECT "messages".* FROM "messages"

  def create
    @message = Message.new(message_params)

    respond_to do |format|
      if @message.save
---
INSERT INTO "messages" ("body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "asdasd"], ["user_id", 0], ["created_at", "2016-06-26 09:48:45.313658"], ["updated_at", "2016-06-26 09:48:45.313658"]]

  def update
    respond_to do |format|
      if @message.update(message_params)
---
UPDATE "messages" SET "user_id" = ?, "updated_at" = ? WHERE "messages"."id" = ?  [["user_id", 3], ["updated_at", "2016-06-26 10:01:14.896950"], ["id", 2]]

  def destroy
    @message.destroy
---
DELETE FROM "messages" WHERE "messages"."id" = ?  [["id", 14]]

    def set_message
      @message = Message.find(params[:id])
---
SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT 1  [["id", 14]]